/*
Училище - Технологично училище "Електронни системи" към ТУ-София http://www.elsys-bg.org/
Клас - 11Б клас
Номер - 6
Име - Божидар Ивов Гьорев
Задача -         Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. 
Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. 
Да се намери второто число N' в интервала [0; +∞) делящо се на x. 
Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. 
Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main()
{
	int arr[10], i, x, n, cp = 1, sum = 0;
	
	do
	{
		printf("Vuvedi x:");
		scanf("%d", &x);
		getchar();
	}
	while(0>x && x>10);
	
	for(i = 0; i < 10; i++)
	{
		sum = 0;
		for(n = cp; ; n++)
		{
			sum += n;
			if(n % ((i+1)*x) == 0)
			{
				cp = n;
				break;
			}
		}
		arr[i] = sum;
	}
	
	for(i = 0; i<10; i++)
	{
		printf("%d - %d\n", i, arr[i]);
	}
	
	return 0;
}
