/*
Училище - Технологично училище "Електронни системи" към ТУ-София http://www.elsys-bg.org/
Клас - 11Б клас
Номер - 6
Име - Божидар Ивов Гьорев
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. 
Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност в масива. 
Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. 
Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main()
{
	int x, i, k, arr[10], sum = 0;
	
	do
	{
		printf("Vuvedi x:");
		scanf("%d", &x);
		getchar();
	}
	while(0>x && x>10);	
	
	for(i = 0; i < 10; i++)
	{
		sum = 0;
		for(k = 0; k < 1000; k++)
		{
			if(k%((i+1)*x) == 0)
				sum += k;
		}
		arr[i] = sum;
	}
	
	for(i = 0; i < 10; i++)
	{
		printf("%d - %d\n", i, arr[i]); 
	}
	
	
	return 0;
}
