/*
Училище - Технологично училище "Електронни системи" към ТУ-София http://www.elsys-bg.org/
Клас - 11Б клас
Номер - 6
Име - Божидар Ивов Гьорев
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива. 
Да се намери второто просто число в интервала [0;  +∞) завършващо на x и да се запише като втори елемент в масива.
Аналогично да се намерят първите N прости числа в интервала [0;  +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main()
{
	int i, k, m = 2, n, x, b = 0;
	int arr[10];

	do
	{
		printf("Vuvedi x:");
		scanf("%d", &x);
		getchar();
	}
	while(0>x && x>10);

	for(i = 0; i < 10; i++)
	{
		for(k = m; ; k++)
		{
			for(n = 2; ; n++)
			{
				if(k%n == 0)
				{
					break;
				}
			}
			if(k == n && k%10 == x)
			{
					break;
			}
		}
		arr[i] = k;
		m = k + 1;
	}
	
	for(i = 0; i < 10; i++)
	{
		printf("%d - %d\n", i, arr[i]); 
	}

	return 0;
}
