/*
Училище - Технологично училище "Електронни системи" към ТУ-София http://www.elsys-bg.org/
Клас - 11Б клас
Номер - 6
Име - Божидар Ивов Гьорев
Задача - Да се разработи програма, която изисква от потребителя да въведе целочислено число, x, където 0 < x < 10. 
Да се инициализират масива от 10 елемента. Стойностите на елементите на масива да са равни на косинус от индекса на елемента. 
Да се изведе масивът, след което да се сортира в низходящ ред и отново да се изведе.
*/

#include<stdio.h>
#include<math.h>

int main()
{
	int i, k;
	double box,arr[10];
	
	for(i = 0; i < 10; i++)
	{
		arr[i] = cos(i);
	}

	for(i = 0; i < 10; i++)
	{
		printf("%d - %f - nesortiran\n", i, arr[i]);
	}

	for(i = 9; i > 0; i--)
	{
		for(k = 1; k <= i; k++)
		{
			if(arr[k-1]<arr[k])
			{
				box = arr[k-1];
				arr[k-1] = arr[k];
				arr[k] = box;
			}
		}
	}

	for(i = 0; i < 10; i++)
	{
		printf("%d - %f - sortiran\n", i, arr[i]);
	}

	return 0;
}
