/*
Училище - Технологично училище "Електронни системи" към ТУ-София http://www.elsys-bg.org/
Клас - 11Б клас
Номер - 6
Име - Божидар Ивов Гьорев
Задача -        Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. 
Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) в интервала [0; +∞), 
в които третата цифра след десетичната запетая е x. Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. 
При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6. Намерените стойности да се зададат като стойности на елементите в масива. 
Елементите на масива да се изведат на стандартния изход. 
*/

#include<stdio.h>
#include<math.h>

int main()
{
	int x, i, k, l = 1, n;
	double arr[10];
	do
	{
		printf("Vuvedi x:");
		scanf("%d", &x);
		getchar();
	}
	while(0>x && x>10);	
	
	for(i = 0; i < 10; i++)
	{
		for(k = l; ; k++)
		{
			n = (int)(cos(k) * 1000);
			if (n%10 == x)
			{
				arr[i] = cos(k);
				l = k + 1;
				break;
			}
		}
	}	
	
	for(i = 0; i < 10; i++)
	{
		printf("%d - %f\n", i, arr[i]); 
	}
	
	return 0;
}
