/*
Училище - Технологично училище "Електронни системи" към ТУ-София http://www.elsys-bg.org/
Клас - 11Б клас
Номер - 6
Име - Божидар Ивов Гьорев
Задача -         Да се разработи програма, която изисква от потребителя да въведе число x, където 0<x<1. Да се намери числото пи чрез следното развитие в ред:
            4-4/3+4/5-4/7+4/9-4/11+...4/N. Развитието в ред спира при 4/N<x. Получената стойност за пи да се изведе на екрана.
*/

#include<stdio.h>

int main()
{
	double pi = 4.00f;
	float x;
	int i,k = 1;

	do
	{
		printf("Vuvedete x(0<x<1):");
		scanf("%f",&x);
		getchar();
	}
	while(0>x && x>1);
	
	for(i = 3; (float) pi/i>x; i += 2)
	{
		if(k%2 == 0)
		{
			pi += (double) 4/i;			
		}
		else
		{
			pi -= (double) 4/i;
		}
		k++;
	}
	
	printf("%f\n", pi);

	return 0;
}
